export const StarNameMap = {
  101: '身心健康基础星',
  102: '品格情怀基础星',
  103: '创新思维基础星',
  104: '审美雅趣基础星',
  105: '人文表达基础星',
  106: '箭鱼之星',
  107: '白鲸之星',
  108: '海豚之星',
  109: '珊瑚之星',
  110: '海狮之星',
  111: '尼莫之星',
  112: '企鹅之星',
  113: '章鱼之星',
  114: '水母之星',
  115: '海马之星',
  116: '自定义星',
  117: '海洋银星',
  118: '海洋全能星',
  119: '海洋金星',
};

export const StarCodeMap = {
  101: '', // 基础星
  102: '', // 基础星
  103: '', // 基础星
  104: '', // 基础星
  105: '', // 基础星

  106: 'jy',
  107: 'bj',
  108: 'ht',
  109: 'sh',
  110: 'hs',
  111: 'nm',
  112: 'qe',
  113: 'zy',
  114: 'sm',
  115: 'hm',
  116: 'zdy',
  117: 'silver',
  118: 'all',
  119: 'gold',
};

export const ColorNumMap = {
  1: 'green',
  2: 'yellow',
  3: 'red',
  4: 'pink',
  5: 'blue',
  6: 'purple',
};
